USE [ChampionsLegaueDb]
GO

CREATE VIEW Матч_1 AS SELECT DISTINCT  [Дата матча], [Код команди господарів], 
[Код команди гостей], [Забиті голи господарями], [Забиті гостями]
FROM Матч;

SELECT *
FROM Матч_1
WHERE ((Матч_1.[Дата матча]))>'11/01/2019'

SELECT Матч.[Дата матча], Матч.[Код команди господарів], Матч.[Код команди гостей], 
Матч.[Забиті голи господарями], Матч.[Забиті гостями], Стадіони.Назва,Стадіони.Країна,
Стадіони.Місто, Стадіони.Місткість
FROM Матч, Стадіони
WHERE Матч.Стадіон = Стадіони.Стадіон;

SELECT Матч.[Дата матча], Матч.[Код команди господарів], Матч.[Код команди гостей], 
Матч.[Забиті голи господарями], Матч.[Забиті гостями], Стадіони.Назва,Стадіони.Країна,
Стадіони.Місто, Стадіони.Місткість
FROM Матч, Стадіони
WHERE Матч.Стадіон = Стадіони.Стадіон AND Стадіони.Місткість >50000;

