USE [ChampionsLegaueDb]
GO
Select *
From Стадіони
Where Назва Like '%лі%'
Order By Місткість DESC;

Select Назва, Країна, Місто, Місткість, [Дата матча]
from Стадіони LEFT JOIN Матч ON Стадіони.Стадіон= Матч.Стадіон;

Select [Дата матча], [Код команди господарів], [Код команди гостей], [Забиті голи господарями], [Забиті гостями], Назва
from Матч INNER JOIN Стадіони ON Матч.Стадіон=Стадіони.Стадіон;

Select [Дата матча], [Код команди господарів], [Код команди гостей], [Забиті голи господарями], [Забиті гостями], Назва
from Матч INNER JOIN Стадіони ON Матч.Стадіон=Стадіони.Стадіон
Where Стадіони.Країна IN('Англія');

Select [Дата матча], [Код команди господарів],[Код команди гостей],[Забиті голи господарями],[Забиті гостями]
from Матч
WHERE NOT EXISTS(
Select [Головний суддя]
from Судді
Where Судді.Бригада=Матч.[Суддівська бригада] AND [Головний суддя] LIKE 'Е%'
);

Select *
from Стадіони
Where Місткість BETWEEN 50000 AND 90000;

Select *
from Команда
Where NOT Команда.Код>7 AND NOT Команда.Код<4;

